Revit 2027 API
AlignedFreeFormSetOrientationOptions Enumeration
Note: This API is now obsolete.
 Orientation options for Aligned Free Form Rebar set.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[ObsoleteAttribute("This enum is deprecated in Revit 2027 and might be removed in a future version. Use FreeFormSetOrientationOptions enum instead.")]
public enum AlignedFreeFormSetOrientationOptions
<ObsoleteAttribute("This enum is deprecated in Revit 2027 and might be removed in a future version. Use FreeFormSetOrientationOptions enum instead.")>
Public Enumeration AlignedFreeFormSetOrientationOptions
[ObsoleteAttribute(L"This enum is deprecated in Revit 2027 and might be removed in a future version. Use FreeFormSetOrientationOptions enum instead.")]
public enum class AlignedFreeFormSetOrientationOptions
[<ObsoleteAttribute("This enum is deprecated in Revit 2027 and might be removed in a future version. Use FreeFormSetOrientationOptions enum instead.")>]
type AlignedFreeFormSetOrientationOptions
Members
Member name | Value | Description
AlignedToDistributionPath | 0 |  Cutting planes are perpendicular to the distribution path.
ParallelToFace | 2 |  Cutting planes are parallel to a selected planar face.
PerpendicularToFace | 3 |  Cutting planes are oriented perpendicular to a selected planar face, X or Y vector being the face normal.
Vertical | 1 |  Cutting planes are oriented vertically, X or Y vector being Z axis.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace